// - Користувач вводить або має два числа.
//     Потрібно знайти та вивести максимальне число з тих двох .
//     Також потрібно врахувати коли введені рівні числа.
let number1 = prompt(`введіть перше число`);
let number2 = prompt(`введіть друге число`);
if (number1 > number2) {
    console.log(number1)
} else if (number2 > number1) {
    console.log(number2)
} else if (number1 === number2) {
    console.log(`введено рівні числа`)
}
// - У першому під'їзді квартири з 1 до 20. У другому з 21 по 48. У третьому з 49 по 90.
// Користувач вводить номер квартири просто в змінні або через prompt('') .
// Програма повинна зазначити, в якому під'їзді знаходиться дана квартира.
let room = prompt(`введіть номер квартири`);
if (room >= 1 && room <= 20) {
    console.log(`квартира знаходиться в першому під'їзді`)
} else if (room >= 21 && room <= 48) {
    console.log(`квартира знаходиться в другому під'їзді`)
} else if (room >= 49 && room <= 90) {
    console.log(`квартира знаходиться в третьому під'їзді`)
}
//- Ми маємо змінну number в яку користувач задає числове значення,  якщо змінна рівна 10 вивести повідомлення ВІРНО, якщо змінна не рівна 10 - тоді НЕВІРНО
let number = prompt(`введіть число`);
if (number == 10) {
    console.log(`ВІРНО`)
} else {
    console.log(`НЕВІРНО`)
}
// - Ми маємо змінну x в яку користувач задає  значення,  якщо в змінну записане число, вивести 1,
//     якщо в змінну записали стрінгу вивести 2, якщо булеве значення - 3, якщо об'єкт або масив - 3.
// якщо в змінну записали щось інше, спрацьовує else
let x = "[]"
// це завдання я не розумію, тому що завжди виводить стрінг
// Warning:(38, 12) Redundant 'typeof' check: 'x' always has type 'string'
if (typeof x === `number`) {
    document.write(1);
} else if (typeof x === `string`) {
    document.write(2)
} else if (typeof x === `boolean`) {
    document.write(3)
} else if (typeof x === `object`) {
    document.write(3)
} else {
    document.write(`спробуйте ще раз`)
}
//- Задача-гра "чи ми йдемо сьогодні в OKTEN на навчання?".
// Змінна, яка характеризує температуру. Якщо температура від +10 до +22 вивести повідомлення що ми йдемо ВЧИТИСЯ .
// Якщо інша темпаретура, тоді виводимо повідомлення що сидимо вдома і вчимося ОНЛАЙН
let temperature = +prompt(`яка зараз температура повітря на вулиці?`);
if (temperature >= 10 && temperature <= 22) {
    console.log(`ми йдемо ВЧИТИСЯ`)
} else {
    console.log(`сидимо вдома і вчимося ОНЛАЙН`)
}
//- За допомогою switch case - реалізувати гру - вікторину, де ми вводимо число від 1 до 5. І взалежності від введеного
// числа нам дається приз. (Авто, Мото, Телефон, і т.д ) і якщо число не підходить тоді  вивести Повідомлення - що число не вірне ... .
let someNumber = +prompt(`введіть число від 1 до 5`);
switch (someNumber) {
    case 1:
        alert("Вітаємо! Ви виграли автомобіль!!!");
        break;
    case 2:
        alert("Вітаємо! Ви виграли мотобайк!!!");
        break;
    case 3:
        alert("Вітаємо! Ви виграли велосипед!!!");
        break;
    case 4:
        alert("Вітаємо! Ви виграли самокат!!!");
        break;
    case 5:
        alert("Вітаємо! Ви виграли гіроборд!!!");
        break;
    default:
        alert("Ви ввели не те число.....До побачення. Ви самое слабое звино!!! ПРОЩАЙТЕ!!!");
}




